[{
        "title": "What is Computer?",
        "subtitle": "a computer is an electronic device that manipulates information, or data.",
        "image_url": "https://www.bu.edu/met/files/2020/09/csit-sa-hero-1200x400.jpg",
        "detail": "คอมพิวเตอร์ (อังกฤษ: computer) หรือศัพท์บัญญัติราชบัณฑิตยสภาว่า คณิตกรณ์ เป็นเครื่องจักรแบบสั่งการได้ที่ออกแบบมาเพื่อดำเนินการกับลำดับตัวดำเนินการทางตรรกศาสตร์หรือคณิตศาสตร์ โดยอนุกรมนี้อาจเปลี่ยนแปลงได้เมื่อพร้อม ส่งผลให้คอมพิวเตอร์สามารถแก้ปัญหาได้มากมาย \n\nคอมพิวเตอร์ถูกประดิษฐ์ออกมาให้ประกอบไปด้วยความจำรูปแบบต่าง ๆ เพื่อเก็บข้อมูล อย่างน้อยหนึ่งส่วนที่มีหน้าที่ดำเนินการคำนวณเกี่ยวกับตัวดำเนินการทางตรรกศาสตร์ และตัวดำเนินการทางคณิตศาสตร์ และส่วนควบคุมที่ใช้เปลี่ยนแปลงลำดับของตัวดำเนินการโดยยึดสารสนเทศที่ถูกเก็บไว้เป็นหลัก อุปกรณ์เหล่านี้จะยอมให้นำเข้าข้อมูลจากแหล่งภายนอก และส่งผลจากการคำนวณตัวดำเนินการออกไป"
    },

    {
        "title": "What is Programmer?",
        "subtitle": " a person who creates computer software",
        "image_url": "https://content.techgig.com/photo/76354712/roadmap-to-become-a-successful-programmer.jpg?216831",
        "detail": "นักเขียนโปรแกรม หรือ โปรแกรมเมอร์ (อังกฤษ: programmer) มีหน้าที่หลักคือการเขียนโปรแกรมคอมพิวเตอร์ ซึ่งนักเขียนโปรแกรมสามารถหมายถึงผู้ที่เชี่ยวชาญในการโปรแกรมเฉพาะด้าน หรือผู้ที่สามารถเขียนรหัสซอฟต์แวร์ได้หลากหลายข้อมูล"
    },

    {
        "title": "What is Software?",
        "subtitle": "Software is a set of instructions, data or programs used to operate computers and execute specific tasks",
        "image_url": "https://tips.thaiware.com/upload_misc/tips/2020_07/images/1322_200708194017Rc_106.png",
        "detail": "ซอฟต์แวร์ (อังกฤษ: software) หรือ ส่วนชุดคำสั่ง คือ ส่วนหนึ่งของระบบคอมพิวเตอร์ที่ใช้ในการจัดเก็บและประมวลผลข้อมูล เป็นชุดคำสั่งที่บอกวิธีการทำงานของคอมพิวเตอร์ ซึ่งตรงกันข้ามกับฮาร์ดแวร์ที่เป็นระบบคอมพิวเตอร์ที่สามารถจับต้องได้ ในสาขาวิชาวิทยาการคอมพิวเตอร์และวิศวกรรมซอฟต์แวร์นั้น ซอฟต์แวร์คอมพิวเตอร์ คือ ข้อมูลทั้งหมดที่ได้รับการประมวลผลโดยระบบคอมพิวเตอร์ และ โปรแกรมคอมพิวเตอร์ ซอฟต์แวร์คอมพิวเตอร์นั้นประกอบด้วย \n\nโปรแกรมคอมพิวเตอร์, ไลบรารี และ ข้อมูลที่ไม่สามารถเรียกใช้งานได้ด้วยโปรแกรมคอมพิวเตอร์ อาทิ เอกสารออนไลน์หรือสื่อดิจิทัล คอมพิวเตอร์เครื่องหนึ่งจำเป็นต้องมีทั้งฮาร์ดแวร์และซอฟต์แวร์ และหากขาดอย่างใดอย่างหนึ่งไป จะไม่สามารถใช้งานระบบคอมพิวเตอร์ได้"
    },

    {
        "title": "what is hardware?",
        "subtitle": "D the machines, wiring, and other physical components of a computer or other electronic system",
        "image_url": "https://i.ytimg.com/vi/_2MB8F9JSa8/maxresdefault.jpg",
        "detail": "ส่วนอุปกรณ์ คอมพิวเตอร์ฮาร์ดแวร์ หรือ ฮาร์ดแวร์คอมพิวเตอร์ (อังกฤษ: computer hardware) หรือเรียกย่อว่า ฮาร์ดแวร์ (อังกฤษ: hardware) เป็นชุดขององค์ประกอบต่าง ๆ ที่ประกอบรวมกันเป็นระบบคอมพิวเตอร์ ฮาร์ดแวร์คอมพิวเตอร์เป็นส่วนประกอบกายภาพ \n\nเช่น จอภาพ เมาส์ คีย์บอร์ด แหล่งเก็บข้อมูลคอมพิวเตอร์ ฮาร์ดดิสก์ การ์ดจอ การ์ดเสียง หน่วยความจำ (RAM) แผงวงจรหลัก เป็นต้น ทั้งหมดเป็นวัตถุที่จับต้องได้ ในทางกลับกัน ซอฟต์แวร์ คือชุดคำสั่งที่สามารถจัดเก็บและทำงานด้วยฮาร์ดแวร์"
    }
]
